#+CATEGORY: NovelDownloader

* TODO v1.0
** TODO v0.1
   SCHEDULED: <2020-03-14 週六>
*** WIP before release
    SCHEDULED: <2020-03-21 週六>
**** TODO add git tag
     SCHEDULED: <2020-03-21 週六>
**** DONE add version option for the program
     CLOSED: [2020-03-21 週六 15:02] SCHEDULED: <2020-03-21 週六>
     :LOGBOOK:
     CLOCK: [2020-03-21 週六 14:41]--[2020-03-21 週六 15:02] =>  0:21
     :END:
*** DONE add processor factory module
    CLOSED: [2020-03-07 週六 16:57] SCHEDULED: <2020-03-07 週六>
    :LOGBOOK:
    CLOCK: [2020-03-07 週六 16:27]--[2020-03-07 週六 16:56] =>  0:29
    :END:
*** DONE read processor configuration from a file
    CLOSED: [2020-03-07 週六 17:29] SCHEDULED: <2020-03-07 週六>
    :LOGBOOK:
    CLOCK: [2020-03-07 週六 17:16]--[2020-03-07 週六 17:29] =>  0:13
    CLOCK: [2020-03-07 週六 17:02]--[2020-03-07 週六 17:12] =>  0:10
    :END:
*** DONE add readme file
    CLOSED: [2020-03-14 週六 15:26] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 15:02]--[2020-03-14 週六 15:26] =>  0:24
    :END:
*** DONE update documentation of novelDownloader.pl
    CLOSED: [2020-03-14 週六 14:59] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 14:37]--[2020-03-14 週六 14:59] =>  0:22
    :END:
*** DONE push repository to github
    CLOSED: [2020-03-14 週六 15:31] SCHEDULED: <2020-03-14 週六>
    :LOGBOOK:
    CLOCK: [2020-03-14 週六 15:27]--[2020-03-14 週六 15:31] =>  0:04
    :END:
** TODO v0.2
*** TODO add git tag
*** TODO update version string
*** TODO add unit tests [0%]
    - [ ] XHTML::Writer.pm
    - [ ] NovelDownloader::Downloader.pm
    - [ ] NovelDownloader::Exporter.pm
    - [ ] NovelDownloader::Wenku8Downloader.pm
    - [ ] NovelDownloader::Wenku8Exporter.pm
    - [ ] NovelDownloader::ProcessorFactory.pm
*** TODO add documentations [0%]
    - [ ] novelDownloader.pl
    - [ ] XHTML::Writer.pm
    - [ ] NovelDownloader::Downloader.pm
    - [ ] NovelDownloader::Exporter.pm
    - [ ] NovelDownloader::Wenku8Downloader.pm
    - [ ] NovelDownloader::Wenku8Exporter.pm
    - [ ] NovelDownloader::ProcessorFactory.pm
*** TODO support configuration
*** TODO support user level processor configuration file
*** TODO seperate data structure to different module
** TODO before release
*** TODO add git tag
*** TODO update version string
* TODO v1.1
** TODO support comicbus.com
** TODO support seba.com
** TODO before release
*** TODO add git tag
*** TODO update version string
* TODO v1.2
** TODO add GUI
** TODO before release
*** TODO add git tag
*** TODO update version string
* unplanned
** TODO build self contained binary
** TODO support cover image for www.wenku8.com
** TODO support default download
   - download according to a configuration file
   - download only when need to update
** TODO support parallel download
** TODO add traditional chinese readme file
